# первый слой: сборка приложения
FROM node:16.16.0 AS builder

# Создаем директорию приложения в контейнере
WORKDIR /app

# Копируем package.json и package-lock.json (или yarn.lock) для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальные файлы приложения
COPY . .

# второй слой: запуск
FROM node:16.16.0

# Создаем директорию приложения в контейнере
WORKDIR /app

# Копируем только необходимые файлы из первого слоя
COPY --from=builder /app .

# Указываем порт, который будет использоваться приложением
EXPOSE 3000

# Команда для запуска приложения
CMD ["node", "app.js"]
